#!/usr/bin/env bash
# Chprompt Project

echo -ne "
\033[48;5;234m\033[38;5;82m▛▀▀▀▀▀▀▀▀▀▜\033[0m
\033[38;5;45m▌ \033[38;5;207mUser: $(command whoami)  Host: $(command hostname)  Exit: $?  ▌
\033[38;5;207m▌ \033[38;5;45mDir:  ~/$(command basename "$(pwd)")  ▌
\033[38;5;82m▙▄▄▄▄▄▄▄▄▟ \033[0m
\033[38;5;45m❯\033[0m
"

export PS1='\[\033[0m\]\n\[\033[48;5;234m\]\[\033[38;5;82m\]▛▀▀▀▀▀▀▀▀▀▜\[\033[0m\]\n\[\033[38;5;45m\]▌ \[\033[38;5;207m\]User: \u  Host: \h  Exit: $(echo -e "$?")  ▌\n\[\033[38;5;207m\]▌ \[\033[38;5;45m\]Dir:  \w  ▌\n\[\033[38;5;82m\]▙▄▄▄▄▄▄▄▄▟ \[\033[0m\]\n\[\033[38;5;45m\]❯\[\033[0m\] '

# Copyright (c) 2026 Zeronetsec