#!/usr/bin/env bash
# Chprompt Project

echo -ne "
\033[48;5;232m\033[38;5;46m╔═▸ USER: $(command whoami) ═▸╗\033[0m
\033[48;5;233m\033[38;5;118m║ HOST: $(command hostname) ║
\033[48;5;234m\033[38;5;207m║ DIR: ~/$(command basename "$(pwd)") ║
\033[48;5;235m\033[38;5;82m╚═▸ ❯\033[0m
"

export PS1='\[\033[0m\]\n\[\033[48;5;232m\]\[\033[38;5;46m\]╔═▸ USER: \u ═▸╗\[\033[0m\]\n\[\033[48;5;233m\]\[\033[38;5;118m\]║ HOST: \h ║\n\[\033[48;5;234m\]\[\033[38;5;207m\]║ DIR: \w ║\n\[\033[48;5;235m\]\[\033[38;5;82m\]╚═▸ ❯\[\033[0m\] '

# Copyright (c) 2026 Zeronetsec