#!/usr/bin/env bash
# Chprompt Project

echo -ne "
\033[48;5;235m\033[38;5;82m╔═════════════════════════════════╗\033[0m
\033[38;5;45m║ ░ USER: $(command whoami) ░ HOST: $(command hostname) ░ EXIT: $? ░ ║
\033[38;5;207m║ ░ PATH: ~/$(command basename "$(pwd)") ░ SHELL: $(command basename "$SHELL") ░ ║
\033[38;5;82m║ ░ TIME: $(command date +%T) ░ DATE: $(command date "+%a %b %d") ░ ║
\033[38;5;45m╚═════════════════════════════════╝
\033[38;5;82m▌❯\033[0m
"

export PS1='\[\033[0m\]\n\[\033[48;5;235m\]\[\033[38;5;82m\]╔═════════════════════════════════╗\[\033[0m\]\n\[\033[38;5;45m\]║ ░ USER: \u ░ HOST: \h ░ EXIT: $(echo -e "$?") ░ ║\n\[\033[38;5;207m\]║ ░ PATH: \w ░ SHELL: $(command basename "$SHELL") ░ ║\n\[\033[38;5;82m\]║ ░ TIME: \t ░ DATE: \d ░ ║\n\[\033[38;5;45m\]╚═════════════════════════════════╝\n\[\033[38;5;82m\]▌❯\[\033[0m\] '

# Copyright (c) 2026 Zeronetsec